# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'nginx'
brew 'node'

# Apps
cask '1password'
brew 'github'
cask '1password-cli'
cask 'alfred'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'notion'
cask 'phpstorm'
cask 'vivaldi'
cask 'microsoft-edge'
cask 'slack'
cask 'tableplus'
cask 'stoplight-studio'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'avast-security'
cask 'vlc'
cask 'mysqlworkbench'
cask 'balenaetcher'
cask 'sdformatter'
cask 'hyper'
cask 'brave-browser'
cask 'flux'
cask 'zoomus'
cask 'teamviewer'
cask 'kap'
cask 'spotify'
cask 'terminus'
cask 'edex-ui'
cask 'adobe-creative-cloud'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Bear', id: 1091189122
mas 'Trello', id: 1278508951
mas 'HEY Email', id: 1506603805
mas 'Todoist: To-Do List & Tasks', id: 585829637